avr-rust/avrd/packs/xmegab/ATxmega64B1.atdf
          </instance>
          <instance name="DFLLRC2M">
            <register-group address-space="data" offset="0x0068" name-in-module="DFLL" name="DFLLRC2M"/>
          </instance>
        </module>
        <module name="PR" id="I6080" version="XMEGAB">
          <instance name="PR">
            <register-group address-space="data" offset="0x0070" name-in-module="PR" name="PR"/>
          </instance>
        </module>
        <module name="RST" id="I6083" version="XMEGAAU">
          <instance name="RST">
            <register-group address-space="data" offset="0x0078" name-in-module="RST" name="RST"/>
          </instance>
        </module>
        <module name="WDT" id="I6078">
          <instance name="WDT">
            <register-group address-space="data" offset="0x0080" name-in-module="WDT" name="WDT"/>
          </instance>
        </module>
        <module name="MCU" id="I6091" version="XMEGAB">
          <instance name="MCU">
            <register-group address-space="data" offset="0x0090" name-in-module="MCU" name="MCU"/>
          </instance>
        </module>
        <module name="PMIC" id="I6057">
          <instance name="PMIC">
            <register-group address-space="data" offset="0x00A0" name-in-module="PMIC" name="PMIC"/>
          </instance>
        </module>
        <module name="PORTCFG" id="I6075" version="XMEGAB">
          <instance name="PORTCFG">
            <register-group address-space="data" offset="0x00B0" name-in-module="PORTCFG" name="PORTCFG"/>
            <signals>
              <signal field="CLKOUT" function="CLKOUTC" group="CLKOUT" pad="PD7"/>
              <signal field="EVOUT" function="EVOUTC" group="EVOUT" pad="PD7"/>
              <signal field="RTCOUT" function="RTCOUTC" group="RTCOUT" pad="PD6"/>
              <signal field="CLKOUT" function="CLKOUTE" group="CLKOUT" pad="PE7"/>
              <signal field="EVOUT" function="EVOUT" group="EVOUT" pad="PE7"/>
            </signals>
          </instance>
        </module>
        <module name="AES" id="I6096">
          <instance name="AES">
            <register-group address-space="data" offset="0x0C0" name-in-module="AES" name="AES"/>
          </instance>
        </module>
        <module name="CRC" id="I6111" version="XMEGAB">
          <instance name="CRC">
            <register-group address-space="data" offset="0x0D0" name-in-module="CRC" name="CRC"/>
          </instance>
        </module>
        <module name="DMA" id="I3000" version="XMEGAB">
          <instance name="DMA">
            <register-group address-space="data" offset="0x0100" name-in-module="DMA" name="DMA"/>
          </instance>
        </module>
        <module name="EVSYS" id="I6061" version="XMEGAB">
          <instance name="EVSYS">
            <register-group address-space="data" offset="0x0180" name-in-module="EVSYS" name="EVSYS"/>
          </instance>
        </module>
        <module name="NVM" id="I6076" version="XMEGAAU">
          <instance name="NVM">
            <register-group address-space="data" offset="0x01C0" name-in-module="NVM" name="NVM"/>
          </instance>
        </module>
        <module name="ADC" id="I6110" version="XMEGAB">
          <instance name="ADCA">
            <register-group address-space="data" offset="0x0200" name-in-module="ADC" name="ADCA"/>
            <signals>
              <signal function="ADC" group="ADC" index="0" pad="PA0"/>
              <signal function="ADC" group="ADC" index="1" pad="PA1"/>
              <signal function="ADC" group="ADC" index="2" pad="PA2"/>
              <signal function="ADC" group="ADC" index="3" pad="PA3"/>
              <signal function="ADC" group="ADC" index="4" pad="PA4"/>
              <signal function="ADC" group="ADC" index="5" pad="PA5"/>
              <signal function="ADC" group="ADC" index="6" pad="PA6"/>
              <signal function="ADC" group="ADC" index="7" pad="PB0"/>
              <signal function="ADC" group="ADC" index="8" pad="PB1"/>
              <signal function="ADC" group="ADC" index="9" pad="PB2"/>
              <signal function="ADC" group="ADC" index="10" pad="PB3"/>
              <signal function="ADC" group="ADC" index="11" pad="PB4"/>
              <signal function="ADC" group="ADC" index="12" pad="PB5"/>
              <signal function="ADC" group="ADC" index="13" pad="PB6"/>
              <signal function="ADC" group="ADC" index="14" pad="PB7"/>
              <signal function="ADC" group="ADC" index="15" pad="PB8"/>
              <signal function="AREF" group="REFA" index="0" pad="PA0"/>
              <signal function="AREF" group="REFB" index="0" pad="PB0"/>
            </signals>
          </instance>
          <instance name="ADCB">
            <register-group address-space="data" offset="0x0240" name-in-module="ADC" name="ADCB"/>
            <signals>
              <signal function="ADC" group="ADC" index="0" pad="PB0"/>
              <signal function="ADC" group="ADC" index="1" pad="PB1"/>
              <signal function="ADC" group="ADC" index="2" pad="PB2"/>
              <signal function="ADC" group="ADC" index="3" pad="PB3"/>
              <signal function="ADC" group="ADC" index="4" pad="PB4"/>
              <signal function="ADC" group="ADC" index="5" pad="PB5"/>
              <signal function="ADC" group="ADC" index="6" pad="PB6"/>
              <signal function="ADC" group="ADC" index="7" pad="PB7"/>
              <signal function="AREF" group="REFA" index="0" pad="PA0"/>
              <signal function="AREF" group="REFB" index="0" pad="PB0"/>
            </signals>
          </instance>
        </module>
        <module name="AC" id="I6077" version="XMEGAB">
          <instance name="ACA">
            <register-group address-space="data" offset="0x0380" name-in-module="AC" name="ACA"/>
            <signals>
              <signal function="AC" group="AC" index="0" pad="PA0"/>
              <signal function="AC" group="AC" index="1" pad="PA1"/>
              <signal function="AC" group="AC" index="2" pad="PA2"/>
              <signal function="AC" group="AC" index="3" pad="PA3"/>
              <signal function="AC" group="AC" index="4" pad="PA4"/>
              <signal function="AC" group="AC" index="5" pad="PA5"/>
              <signal function="AC" group="AC" index="6" pad="PA6"/>
              <signal function="AC" group="AC" index="7" pad="PA7"/>
              <signal function="ACOUT" group="ACOUT" index="1" pad="PA6"/>
              <signal function="ACOUT" group="ACOUT" index="0" pad="PA7"/>
            </signals>
          </instance>
