avr-rust/avrd/packs/xmegab/ATxmega64B1.atdf
          </instance>
        </module>
        <module name="LCD" id="I3003">
          <instance name="LCD">
            <register-group address-space="data" offset="0x0D00" name-in-module="LCD" name="LCD"/>
            <signals>
              <signal function="LCD_SEG" group="SEG" index="39" pad="PG0"/>
              <signal function="LCD_SEG" group="SEG" index="38" pad="PG1"/>
              <signal function="LCD_SEG" group="SEG" index="37" pad="PG2"/>
              <signal function="LCD_SEG" group="SEG" index="36" pad="PG3"/>
              <signal function="LCD_SEG" group="SEG" index="35" pad="PG4"/>
              <signal function="LCD_SEG" group="SEG" index="34" pad="PG5"/>
              <signal function="LCD_SEG" group="SEG" index="33" pad="PG6"/>
              <signal function="LCD_SEG" group="SEG" index="32" pad="PG7"/>
              <signal function="LCD_SEG" group="SEG" index="31" pad="PM0"/>
              <signal function="LCD_SEG" group="SEG" index="30" pad="PM1"/>
              <signal function="LCD_SEG" group="SEG" index="29" pad="PM2"/>
              <signal function="LCD_SEG" group="SEG" index="28" pad="PM3"/>
              <signal function="LCD_SEG" group="SEG" index="27" pad="PM4"/>
              <signal function="LCD_SEG" group="SEG" index="26" pad="PM5"/>
              <signal function="LCD_SEG" group="SEG" index="25" pad="PM6"/>
              <signal function="LCD_SEG" group="SEG" index="24" pad="PM7"/>
              <signal function="LCD_SEG" group="SEG" index="23" pad="SEG23"/>
              <signal function="LCD_SEG" group="SEG" index="22" pad="SEG22"/>
              <signal function="LCD_SEG" group="SEG" index="21" pad="SEG21"/>
              <signal function="LCD_SEG" group="SEG" index="20" pad="SEG20"/>
              <signal function="LCD_SEG" group="SEG" index="19" pad="SEG19"/>
              <signal function="LCD_SEG" group="SEG" index="18" pad="SEG18"/>
              <signal function="LCD_SEG" group="SEG" index="17" pad="SEG17"/>
              <signal function="LCD_SEG" group="SEG" index="16" pad="SEG16"/>
              <signal function="LCD_SEG" group="SEG" index="15" pad="SEG15"/>
              <signal function="LCD_SEG" group="SEG" index="14" pad="SEG14"/>
              <signal function="LCD_SEG" group="SEG" index="13" pad="SEG13"/>
              <signal function="LCD_SEG" group="SEG" index="12" pad="SEG12"/>
              <signal function="LCD_SEG" group="SEG" index="11" pad="SEG11"/>
              <signal function="LCD_SEG" group="SEG" index="10" pad="SEG10"/>
              <signal function="LCD_SEG" group="SEG" index="9" pad="SEG9"/>
              <signal function="LCD_SEG" group="SEG" index="8" pad="SEG8"/>
              <signal function="LCD_SEG" group="SEG" index="7" pad="SEG7"/>
              <signal function="LCD_SEG" group="SEG" index="6" pad="SEG6"/>
              <signal function="LCD_SEG" group="SEG" index="5" pad="SEG5"/>
              <signal function="LCD_SEG" group="SEG" index="4" pad="SEG4"/>
              <signal function="LCD_SEG" group="SEG" index="3" pad="SEG3"/>
              <signal function="LCD_SEG" group="SEG" index="2" pad="SEG2"/>
              <signal function="LCD_SEG" group="SEG" index="1" pad="SEG1"/>
              <signal function="LCD_SEG" group="SEG" index="0" pad="SEG0"/>
              <signal function="LCD_BLINK" group="BLINK" index="1" pad="SEG1"/>
              <signal function="LCD_BLINK" group="BLINK" index="0" pad="SEG0"/>
              <signal function="LCD_BIAS" group="BIAS" index="1" pad="BIAS1"/>
              <signal function="LCD_BIAS" group="BIAS" index="2" pad="BIAS2"/>
              <signal function="LCD_BIAS" group="VLCD" pad="VLCD"/>
              <signal function="LCD_BIAS" group="CAPL" pad="CAPL"/>
              <signal function="LCD_BIAS" group="CAPH" pad="CAPH"/>
              <signal function="LCD_COM" group="COM" index="0" pad="COM0"/>
              <signal function="LCD_COM" group="COM" index="1" pad="COM1"/>
              <signal function="LCD_COM" group="COM" index="2" pad="COM2"/>
              <signal function="LCD_COM" group="COM" index="3" pad="COM3"/>
              <signal function="LCD_COM_SWP" group="COM" index="0" pad="COM3"/>
              <signal function="LCD_COM_SWP" group="COM" index="1" pad="COM2"/>
              <signal function="LCD_COM_SWP" group="COM" index="2" pad="COM1"/>
              <signal function="LCD_COM_SWP" group="COM" index="3" pad="COM0"/>
            </signals>
          </instance>
        </module>
        <module name="FUSE" id="I6570" version="XMEGAAU">
          <instance name="FUSE">
            <register-group address-space="fuses" offset="0x00" name-in-module="NVM_FUSES" name="FUSE"/>
          </instance>
        </module>
        <module name="LOCKBIT" id="I6570" version="XMEGAAU">
          <instance name="LOCKBIT">
            <register-group address-space="lockbits" offset="0x00" name-in-module="NVM_LOCKBITS" name="LOCKBIT"/>
          </instance>
        </module>
        <module name="SIGROW" id="I3600" version="XMEGAB">
          <instance name="PROD_SIGNATURES">
            <register-group address-space="prod_signatures" offset="0x00" name-in-module="NVM_PROD_SIGNATURES" name="PROD_SIGNATURES"/>
          </instance>
        </module>
      </peripherals>
      <interrupts>
        <interrupt-group index="1" module-instance="OSC" name-in-module="OSC"/>
        <interrupt-group index="2" module-instance="PORTC" name-in-module="PORT"/>
        <interrupt-group index="4" module-instance="PORTR" name-in-module="PORT"/>
        <interrupt-group index="6" module-instance="DMA" name-in-module="DMA"/>
        <interrupt-group index="10" module-instance="RTC" name-in-module="RTC"/>
        <interrupt-group index="12" module-instance="TWIC" name-in-module="TWI"/>
        <interrupt-group index="14" module-instance="TCC0" name-in-module="TC0"/>
		<interrupt-group index="14" module-instance="TCC2" name-in-module="TC2"/>
        <interrupt-group index="20" module-instance="TCC1" name-in-module="TC1"/>
        <interrupt-group index="24" module-instance="SPIC" name-in-module="SPI"/>
        <interrupt-group index="25" module-instance="USARTC0" name-in-module="USART"/>
        <interrupt-group index="31" module-instance="USB" name-in-module="USB"/>
        <interrupt-group index="35" module-instance="LCD" name-in-module="LCD"/>
        <interrupt-group index="36" module-instance="AES" name-in-module="AES"/>
        <interrupt-group index="37" module-instance="NVM" name-in-module="NVM"/>
        <interrupt-group index="39" module-instance="PORTB" name-in-module="PORT"/>
        <interrupt-group index="41" module-instance="ACB" name-in-module="AC"/>
        <interrupt-group index="44" module-instance="ADCB" name-in-module="ADC"/>
        <interrupt-group index="48" module-instance="PORTD" name-in-module="PORT"/>
        <interrupt-group index="50" module-instance="PORTG" name-in-module="PORT"/>
        <interrupt-group index="52" module-instance="PORTM" name-in-module="PORT"/>
        <interrupt-group index="54" module-instance="PORTE" name-in-module="PORT"/>
        <interrupt-group index="58" module-instance="TCE0" name-in-module="TC0"/>
		<interrupt-group index="58" module-instance="TCE2" name-in-module="TC2"/>
        <interrupt-group index="69" module-instance="USARTE0" name-in-module="USART"/>
        <interrupt-group index="75" module-instance="PORTA" name-in-module="PORT"/>
        <interrupt-group index="77" module-instance="ACA" name-in-module="AC"/>
        <interrupt-group index="80" module-instance="ADCA" name-in-module="ADC"/>
      </interrupts>
      <interfaces>
        <interface type="pdi" name="PDI"/>
        <interface type="xmegajtag" name="JTAG"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="JTAGID" value="0x0965203F"/>
          <property name="SIGNATURE0" value="0x1E"/>
          <property name="SIGNATURE1" value="0x96"/>
          <property name="SIGNATURE2" value="0x52"/>
        </property-group>
        <property-group name="PDI_INTERFACE">
          <property name="APP_SECTION_OFFSET" value="0x00800000"/>
          <property name="APPTABLE_SECTION_OFFSET" value="0x0080F000"/>
          <property name="BOOT_SECTION_OFFSET" value="0x00810000"/>
          <property name="DATAMEM_OFFSET" value="0x01000000"/>
          <property name="EEPROM_OFFSET" value="0x008C0000"/>
          <property name="USER_SIGNATURES_OFFSET" value="0x008E0400"/>
          <property name="PROD_SIGNATURES_OFFSET" value="0x008E0200"/>
          <property name="FUSE_REGISTERS_OFFSET" value="0x008F0020"/>
          <property name="LOCK_REGISTERS_OFFSET" value="0x008F0027"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module name="GPIO" id="I6085" version="XMEGAD" caption="General Purpose IO">
      <register-group caption="General Purpose IO Registers" name="GPIO" size="4">
        <register caption="General Purpose IO Register 0" name="GPIOR0" offset="0x00" size="1"/>
        <register caption="General Purpose IO Register 1" name="GPIOR1" offset="0x01" size="1"/>
