avr-rust/avrd/packs/xmegab/ATxmega64B1.atdf
      <value-group caption="Event Output Port" name="PORTCFG_EVOUT">
        <value caption="Event Output Disabled" name="OFF" value="0x00"/>
        <value caption="Event Channel 0 Output on Port C" name="PC" value="0x01"/>
        <value caption="Event Channel 0 Output on Port E" name="PE" value="0x03"/>
      </value-group>
      <value-group caption="Clock and Event Output Port" name="PORTCFG_CLKEVPIN">
        <value caption="Clock and Event Ouput on PIN 7" name="PIN7" value="0x00"/>
        <value caption="Clock and Event Ouput on PIN 4" name="PIN4" value="0x01"/>
      </value-group>
      <value-group caption="Event Output Select" name="PORTCFG_EVOUTSEL">
        <value caption="Event Channel 0 output to pin" name="0" value="0x00"/>
        <value caption="Event Channel 1 output to pin" name="1" value="0x01"/>
        <value caption="Event Channel 2 output to pin" name="2" value="0x02"/>
        <value caption="Event Channel 3 output to pin" name="3" value="0x03"/>
      </value-group>
    </module>
    <module name="AES" id="I6096" caption="AES Module">
      <register-group caption="AES Module" name="AES" size="5">
        <register caption="AES Control Register" name="CTRL" offset="0x00" size="1">
          <bitfield caption="Start/Run" mask="0x80" name="START"/>
          <bitfield caption="Auto Start Trigger" mask="0x40" name="AUTO"/>
          <bitfield caption="AES Software Reset" mask="0x20" name="RESET"/>
          <bitfield caption="Decryption / Direction" mask="0x10" name="DECRYPT"/>
          <bitfield caption="State XOR Load Enable" mask="0x04" name="XOR"/>
        </register>
        <register caption="AES Status Register" name="STATUS" offset="0x01" size="1">
          <bitfield caption="AES Error" mask="0x80" name="ERROR"/>
          <bitfield caption="State Ready Interrupt Flag" mask="0x01" name="SRIF"/>
        </register>
        <register caption="AES State Register" name="STATE" offset="0x02" size="1"/>
        <register caption="AES Key Register" name="KEY" offset="0x03" size="1"/>
        <register caption="AES Interrupt Control Register" name="INTCTRL" offset="0x04" size="1">
          <bitfield caption="Interrupt level" mask="0x03" name="INTLVL" values="AES_INTLVL"/>
        </register>
      </register-group>
      <value-group caption="Interrupt level" name="AES_INTLVL">
        <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
        <value caption="Low Level" name="LO" value="0x01"/>
        <value caption="Medium Level" name="MED" value="0x02"/>
        <value caption="High Level" name="HI" value="0x03"/>
      </value-group>
      <interrupt-group name="AES">
        <interrupt index="0" name="INT" caption="AES Interrupt"/>
      </interrupt-group>
    </module>
    <module name="CRC" id="I6111" version="XMEGAB" caption="Cyclic Redundancy Checker">
      <register-group caption="Cyclic Redundancy Checker" name="CRC" size="8">
        <register caption="Control Register" name="CTRL" offset="0x00" size="1">
          <bitfield caption="Reset" mask="0xC0" name="RESET" values="CRC_RESET"/>
          <bitfield caption="CRC Mode" mask="0x20" name="CRC32"/>
          <bitfield caption="Input Source" mask="0x0F" name="SOURCE" values="CRC_SOURCE"/>
        </register>
        <register caption="Status Register" name="STATUS" offset="0x01" size="1">
          <bitfield caption="Zero detection" mask="0x02" name="ZERO"/>
          <bitfield caption="Busy" mask="0x01" name="BUSY"/>
        </register>
        <register caption="Data Input" name="DATAIN" offset="0x03" size="1"/>
        <register caption="Checksum byte 0" name="CHECKSUM0" offset="0x04" size="1"/>
        <register caption="Checksum byte 1" name="CHECKSUM1" offset="0x05" size="1"/>
        <register caption="Checksum byte 2" name="CHECKSUM2" offset="0x06" size="1"/>
        <register caption="Checksum byte 3" name="CHECKSUM3" offset="0x07" size="1"/>
      </register-group>
      <value-group caption="Reset" name="CRC_RESET">
        <value caption="No Reset" name="NO" value="0x00"/>
        <value caption="Reset CRC with CHECKSUM to all zeros" name="RESET0" value="0x02"/>
        <value caption="Reset CRC with CHECKSUM to all ones" name="RESET1" value="0x03"/>
      </value-group>
      <value-group caption="Input Source" name="CRC_SOURCE">
        <value caption="Disabled" name="DISABLE" value="0x00"/>
        <value caption="I/O Interface" name="IO" value="0x01"/>
        <value caption="Flash" name="FLASH" value="0x02"/>
        <value caption="DMAC Channel 0" name="DMAC0" value="0x04"/>
        <value caption="DMAC Channel 1" name="DMAC1" value="0x05"/>
      </value-group>
    </module>
    <module name="DMA" id="I3000" version="XMEGAB" caption="DMA Controller">
      <register-group caption="DMA Channel" name="DMA_CH" size="16">
        <register caption="Channel Control" name="CTRLA" offset="0x00" size="1">
          <bitfield caption="Channel Enable" mask="0x80" name="CHEN"/>
          <bitfield caption="Channel Software Reset" mask="0x40" name="CHRST"/>
          <bitfield caption="Channel Repeat Mode" mask="0x20" name="REPEAT"/>
          <bitfield caption="Channel Transfer Request" mask="0x10" name="TRFREQ"/>
          <bitfield caption="Channel Single Shot Data Transfer" mask="0x04" name="SINGLE"/>
          <bitfield caption="Channel Transfer Mode" mask="0x03" name="BURSTLEN" values="DMA_CH_BURSTLEN"/>
        </register>
        <register caption="Channel Control" name="CTRLB" offset="0x01" size="1">
          <bitfield caption="Block Transfer Busy" mask="0x80" name="CHBUSY"/>
          <bitfield caption="Block Transfer Pending" mask="0x40" name="CHPEND"/>
          <bitfield caption="Block Transfer Error Interrupt Flag" mask="0x20" name="ERRIF"/>
          <bitfield caption="Transaction Complete Interrup Flag" mask="0x10" name="TRNIF"/>
          <bitfield caption="Transfer Error Interrupt Level" mask="0x0C" name="ERRINTLVL" values="DMA_CH_ERRINTLVL"/>
          <bitfield caption="Transaction Complete Interrupt Level" mask="0x03" name="TRNINTLVL" values="DMA_CH_TRNINTLVL"/>
        </register>
        <register caption="Address Control" name="ADDRCTRL" offset="0x02" size="1">
          <bitfield caption="Channel Source Address Reload" mask="0xC0" name="SRCRELOAD" values="DMA_CH_SRCRELOAD"/>
          <bitfield caption="Channel Source Address Mode" mask="0x30" name="SRCDIR" values="DMA_CH_SRCDIR"/>
          <bitfield caption="Channel Destination Address Reload" mask="0x0C" name="DESTRELOAD" values="DMA_CH_DESTRELOAD"/>
          <bitfield caption="Channel Destination Address Mode" mask="0x03" name="DESTDIR" values="DMA_CH_DESTDIR"/>
        </register>
        <register caption="Channel Trigger Source" name="TRIGSRC" offset="0x03" size="1">
          <bitfield caption="Channel Trigger Source" mask="0xFF" name="TRIGSRC" values="DMA_CH_TRIGSRC"/>
        </register>
        <register caption="Channel Block Transfer Count" name="TRFCNT" offset="0x04" size="2"/>
