avr-rust/avrd/packs/xmegab/ATxmega64B1.atdf
      <value-group caption="Double buffering mode" name="DMA_DBUFMODE">
        <value caption="Double buffering disabled" name="DISABLED" value="0x00"/>
        <value caption="Double buffering enabled on channel 0/1" name="CH01" value="0x01"/>
      </value-group>
      <value-group caption="Priority mode" name="DMA_PRIMODE">
        <value caption="Round Robin" name="RR01" value="0x00"/>
        <value caption="Channel 0 &gt; channel 1" name="CH0RR1" value="0x01"/>
      </value-group>
      <value-group caption="Interrupt level" name="DMA_CH_ERRINTLVL">
        <value caption="Interrupt disabled" name="OFF" value="0x00"/>
        <value caption="Low level" name="LO" value="0x01"/>
        <value caption="Medium level" name="MED" value="0x02"/>
        <value caption="High level" name="HI" value="0x03"/>
      </value-group>
      <value-group caption="Interrupt level" name="DMA_CH_TRNINTLVL">
        <value caption="Interrupt disabled" name="OFF" value="0x00"/>
        <value caption="Low level" name="LO" value="0x01"/>
        <value caption="Medium level" name="MED" value="0x02"/>
        <value caption="High level" name="HI" value="0x03"/>
      </value-group>
      <interrupt-group name="DMA">
        <interrupt index="0" name="CH0" caption="Channel 0 Interrupt"/>
        <interrupt index="1" name="CH1" caption="Channel 1 Interrupt"/>
      </interrupt-group>
    </module>
    <module name="EVSYS" id="I6061" version="XMEGAB" caption="Event System">
      <register-group caption="Event System" name="EVSYS" size="18">
        <register caption="Event Channel 0 Multiplexer" name="CH0MUX" offset="0x00" size="1">
          <bitfield caption="Event Channel 0 Multiplexer" mask="0xFF" name="CHMUX" values="EVSYS_CHMUX"/>
        </register>
        <register caption="Event Channel 1 Multiplexer" name="CH1MUX" offset="0x01" size="1">
          <bitfield caption="Event Channel 1 Multiplexer" mask="0xFF" name="CHMUX" values="EVSYS_CHMUX"/>
        </register>
        <register caption="Event Channel 2 Multiplexer" name="CH2MUX" offset="0x02" size="1">
          <bitfield caption="Event Channel 2 Multiplexer" mask="0xFF" name="CHMUX" values="EVSYS_CHMUX"/>
        </register>
        <register caption="Event Channel 3 Multiplexer" name="CH3MUX" offset="0x03" size="1">
          <bitfield caption="Event Channel 3 Multiplexer" mask="0xFF" name="CHMUX" values="EVSYS_CHMUX"/>
        </register>
        <register caption="Channel 0 Control Register" name="CH0CTRL" offset="0x08" size="1">
          <bitfield caption="Quadrature Decoder Index Recognition Mode" mask="0x60" name="QDIRM" values="EVSYS_QDIRM"/>
          <bitfield caption="Quadrature Decoder Index Enable" mask="0x10" name="QDIEN"/>
          <bitfield caption="Quadrature Decoder Enable" mask="0x08" name="QDEN"/>
          <bitfield caption="Digital Filter" mask="0x07" name="DIGFILT" values="EVSYS_DIGFILT"/>
        </register>
        <register caption="Channel 1 Control Register" name="CH1CTRL" offset="0x09" size="1">
          <bitfield caption="Digital Filter" mask="0x07" name="DIGFILT" values="EVSYS_DIGFILT"/>
        </register>
        <register caption="Channel 2 Control Register" name="CH2CTRL" offset="0x0A" size="1">
          <bitfield caption="Digital Filter" mask="0x07" name="DIGFILT" values="EVSYS_DIGFILT"/>
        </register>
        <register caption="Channel 3 Control Register" name="CH3CTRL" offset="0x0B" size="1">
          <bitfield caption="Digital Filter" mask="0x07" name="DIGFILT" values="EVSYS_DIGFILT"/>
        </register>
        <register caption="Event Strobe" name="STROBE" offset="0x10" size="1"/>
        <register caption="Event Data" name="DATA" offset="0x11" size="1"/>
      </register-group>
      <value-group caption="Quadrature Decoder Index Recognition Mode" name="EVSYS_QDIRM">
        <value caption="QDPH0 = 0, QDPH90 = 0" name="00" value="0x00"/>
        <value caption="QDPH0 = 0, QDPH90 = 1" name="01" value="0x01"/>
        <value caption="QDPH0 = 1, QDPH90 = 0" name="10" value="0x02"/>
        <value caption="QDPH0 = 1, QDPH90 = 1" name="11" value="0x03"/>
      </value-group>
      <value-group caption="Digital filter coefficient" name="EVSYS_DIGFILT">
        <value caption="1 SAMPLE" name="1SAMPLE" value="0x00"/>
        <value caption="2 SAMPLES" name="2SAMPLES" value="0x01"/>
        <value caption="3 SAMPLES" name="3SAMPLES" value="0x02"/>
        <value caption="4 SAMPLES" name="4SAMPLES" value="0x03"/>
        <value caption="5 SAMPLES" name="5SAMPLES" value="0x04"/>
        <value caption="6 SAMPLES" name="6SAMPLES" value="0x05"/>
        <value caption="7 SAMPLES" name="7SAMPLES" value="0x06"/>
        <value caption="8 SAMPLES" name="8SAMPLES" value="0x07"/>
      </value-group>
      <value-group caption="Event Channel multiplexer input selection" name="EVSYS_CHMUX">
        <value caption="Off" name="OFF" value="0x00"/>
        <value caption="RTC Overflow" name="RTC_OVF" value="0x08"/>
        <value caption="RTC Compare Match" name="RTC_CMP" value="0x09"/>
        <value caption="USB Setup, SOF, CRC error and UNF/OVF" name="USB" value="0x0A"/>
        <value caption="Analog Comparator A Channel 0" name="ACA_CH0" value="0x10"/>
        <value caption="Analog Comparator A Channel 1" name="ACA_CH1" value="0x11"/>
        <value caption="Analog Comparator A Window" name="ACA_WIN" value="0x12"/>
        <value caption="Analog Comparator B Channel 0" name="ACB_CH0" value="0x13"/>
        <value caption="Analog Comparator B Channel 1" name="ACB_CH1" value="0x14"/>
        <value caption="Analog Comparator B Window" name="ACB_WIN" value="0x15"/>
        <value caption="ADC A Channel" name="ADCA_CH0" value="0x20"/>
        <value caption="ADC B Channel" name="ADCB_CH0" value="0x24"/>
        <value caption="Port A, Pin0" name="PORTA_PIN0" value="0x50"/>
        <value caption="Port A, Pin1" name="PORTA_PIN1" value="0x51"/>
        <value caption="Port A, Pin2" name="PORTA_PIN2" value="0x52"/>
        <value caption="Port A, Pin3" name="PORTA_PIN3" value="0x53"/>
        <value caption="Port A, Pin4" name="PORTA_PIN4" value="0x54"/>
        <value caption="Port A, Pin5" name="PORTA_PIN5" value="0x55"/>
        <value caption="Port A, Pin6" name="PORTA_PIN6" value="0x56"/>
        <value caption="Port A, Pin7" name="PORTA_PIN7" value="0x57"/>
        <value caption="Port B, Pin0" name="PORTB_PIN0" value="0x58"/>
        <value caption="Port B, Pin1" name="PORTB_PIN1" value="0x59"/>
        <value caption="Port B, Pin2" name="PORTB_PIN2" value="0x5A"/>
        <value caption="Port B, Pin3" name="PORTB_PIN3" value="0x5B"/>
        <value caption="Port B, Pin4" name="PORTB_PIN4" value="0x5C"/>
        <value caption="Port B, Pin5" name="PORTB_PIN5" value="0x5D"/>
        <value caption="Port B, Pin6" name="PORTB_PIN6" value="0x5E"/>
        <value caption="Port B, Pin7" name="PORTB_PIN7" value="0x5F"/>
        <value caption="Port C, Pin0" name="PORTC_PIN0" value="0x60"/>
        <value caption="Port C, Pin1" name="PORTC_PIN1" value="0x61"/>
        <value caption="Port C, Pin2" name="PORTC_PIN2" value="0x62"/>
        <value caption="Port C, Pin3" name="PORTC_PIN3" value="0x63"/>
        <value caption="Port C, Pin4" name="PORTC_PIN4" value="0x64"/>
        <value caption="Port C, Pin5" name="PORTC_PIN5" value="0x65"/>
        <value caption="Port C, Pin6" name="PORTC_PIN6" value="0x66"/>
        <value caption="Port C, Pin7" name="PORTC_PIN7" value="0x67"/>
        <value caption="Port D, Pin0" name="PORTD_PIN0" value="0x68"/>
        <value caption="Port D, Pin1" name="PORTD_PIN1" value="0x69"/>
        <value caption="Port D, Pin2" name="PORTD_PIN2" value="0x6A"/>
        <value caption="Port E, Pin0" name="PORTE_PIN0" value="0x70"/>
        <value caption="Port E, Pin1" name="PORTE_PIN1" value="0x71"/>
        <value caption="Port E, Pin2" name="PORTE_PIN2" value="0x72"/>
        <value caption="Port E, Pin3" name="PORTE_PIN3" value="0x73"/>
        <value caption="Port E, Pin4" name="PORTE_PIN4" value="0x74"/>
        <value caption="Port E, Pin5" name="PORTE_PIN5" value="0x75"/>
        <value caption="Port E, Pin6" name="PORTE_PIN6" value="0x76"/>
        <value caption="Port E, Pin7" name="PORTE_PIN7" value="0x77"/>
        <value caption="Prescaler, divide by 1" name="PRESCALER_1" value="0x80"/>
        <value caption="Prescaler, divide by 2" name="PRESCALER_2" value="0x81"/>
        <value caption="Prescaler, divide by 4" name="PRESCALER_4" value="0x82"/>
        <value caption="Prescaler, divide by 8" name="PRESCALER_8" value="0x83"/>
        <value caption="Prescaler, divide by 16" name="PRESCALER_16" value="0x84"/>
        <value caption="Prescaler, divide by 32" name="PRESCALER_32" value="0x85"/>
        <value caption="Prescaler, divide by 64" name="PRESCALER_64" value="0x86"/>
        <value caption="Prescaler, divide by 128" name="PRESCALER_128" value="0x87"/>
        <value caption="Prescaler, divide by 256" name="PRESCALER_256" value="0x88"/>
        <value caption="Prescaler, divide by 512" name="PRESCALER_512" value="0x89"/>
        <value caption="Prescaler, divide by 1024" name="PRESCALER_1024" value="0x8A"/>
        <value caption="Prescaler, divide by 2048" name="PRESCALER_2048" value="0x8B"/>
        <value caption="Prescaler, divide by 4096" name="PRESCALER_4096" value="0x8C"/>
        <value caption="Prescaler, divide by 8192" name="PRESCALER_8192" value="0x8D"/>
        <value caption="Prescaler, divide by 16384" name="PRESCALER_16384" value="0x8E"/>
        <value caption="Prescaler, divide by 32768" name="PRESCALER_32768" value="0x8F"/>
        <value caption="Timer/Counter C0 Overflow" name="TCC0_OVF" value="0xC0"/>
        <value caption="Timer/Counter C0 Error" name="TCC0_ERR" value="0xC1"/>
        <value caption="Timer/Counter C0 Compare or Capture A" name="TCC0_CCA" value="0xC4"/>
        <value caption="Timer/Counter C0 Compare or Capture B" name="TCC0_CCB" value="0xC5"/>
        <value caption="Timer/Counter C0 Compare or Capture C" name="TCC0_CCC" value="0xC6"/>
        <value caption="Timer/Counter C0 Compare or Capture D" name="TCC0_CCD" value="0xC7"/>
        <value caption="Timer/Counter C1 Overflow" name="TCC1_OVF" value="0xC8"/>
        <value caption="Timer/Counter C1 Error" name="TCC1_ERR" value="0xC9"/>
        <value caption="Timer/Counter C1 Compare or Capture A" name="TCC1_CCA" value="0xCC"/>
        <value caption="Timer/Counter C1 Compare or Capture B" name="TCC1_CCB" value="0xCD"/>
        <value caption="Timer/Counter E0 Overflow" name="TCE0_OVF" value="0xE0"/>
        <value caption="Timer/Counter E0 Error" name="TCE0_ERR" value="0xE1"/>
        <value caption="Timer/Counter E0 Compare or Capture A" name="TCE0_CCA" value="0xE4"/>
        <value caption="Timer/Counter E0 Compare or Capture B" name="TCE0_CCB" value="0xE5"/>
        <value caption="Timer/Counter E0 Compare or Capture C" name="TCE0_CCC" value="0xE6"/>
        <value caption="Timer/Counter E0 Compare or Capture D" name="TCE0_CCD" value="0xE7"/>
      </value-group>
    </module>
    <module name="NVM" id="I6076" version="XMEGAAU" caption="Non Volatile Memory Controller">
      <register-group caption="Non-volatile Memory Controller" name="NVM" size="17">
        <register caption="Address Register 0" name="ADDR0" offset="0x00" size="1"/>
        <register caption="Address Register 1" name="ADDR1" offset="0x01" size="1"/>
        <register caption="Address Register 2" name="ADDR2" offset="0x02" size="1"/>
        <register caption="Data Register 0" name="DATA0" offset="0x04" size="1"/>
