avr-rust/avrd/packs/xmegab/ATxmega64B1.atdf
        <register caption="LCD Data Register 10" name="DATA10" offset="0x1A" size="1"/>
        <register caption="LCD Data Register 11" name="DATA11" offset="0x1B" size="1"/>
        <register caption="LCD Data Register 12" name="DATA12" offset="0x1C" size="1"/>
        <register caption="LCD Data Register 13" name="DATA13" offset="0x1D" size="1"/>
        <register caption="LCD Data Register 14" name="DATA14" offset="0x1E" size="1"/>
        <register caption="LCD Data Register 15" name="DATA15" offset="0x1F" size="1"/>
        <register caption="LCD Data Register 16" name="DATA16" offset="0x20" size="1"/>
        <register caption="LCD Data Register 17" name="DATA17" offset="0x21" size="1"/>
        <register caption="LCD Data Register 18" name="DATA18" offset="0x22" size="1"/>
        <register caption="LCD Data Register 19" name="DATA19" offset="0x23" size="1"/>
      </register-group>
      <value-group caption="Interrupt level" name="LCD_INTLVL">
        <value caption="Interrupt disabled" name="OFF" value="0x00"/>
        <value caption="Low level" name="LO" value="0x01"/>
        <value caption="Medium level" name="MED" value="0x02"/>
        <value caption="High level" name="HI" value="0x03"/>
      </value-group>	  
      <value-group caption="LCD Blink Rate" name="LCD_BLINKRATE">
        <value caption="4Hz Blink Rate" name="4Hz" value="0x00"/>
        <value caption="2Hz Blink Rate" name="2Hz" value="0x01"/>
        <value caption="1Hz Blink Rate" name="1Hz" value="0x02"/>
        <value caption="0.5Hz Blink Rate" name="0Hz5" value="0x03"/>
      </value-group>
      <value-group caption="LCD Clock Divide" name="LCD_CLKDIV">
        <value caption="frame rate of 256 Hz" name="DivBy1" value="0x00"/>
        <value caption="frame rate of 128 Hz" name="DivBy2" value="0x01"/>
        <value caption="frame rate of 83.5 Hz" name="DivBy3" value="0x02"/>
        <value caption="frame rate of 64 Hz" name="DivBy4" value="0x03"/>
        <value caption="frame rate of 51.2 Hz" name="DivBy5" value="0x04"/>
        <value caption="frame rate of 42.7 Hz" name="DivBy6" value="0x05"/>
        <value caption="frame rate of 36.6 Hz" name="DivBy7" value="0x06"/>
        <value caption="frame rate of 32 Hz" name="DivBy8" value="0x07"/>
      </value-group>
      <value-group caption="Duty Select" name="LCD_DUTY">
        <value caption="Duty=1/4, Bias=1/3, COM0:3" name="1_4" value="0x00"/>
        <value caption="Duty=Static, Bias=Static, COM0" name="Static" value="0x01"/>
        <value caption="Duty=1/2, Bias=1/3, COM0:1" name="1_2" value="0x02"/>
        <value caption="Duty=1/3, Bias=1/3, COM0:2" name="1_3" value="0x03"/>
      </value-group>
      <value-group caption="LCD Prescaler Select" name="LCD_PRESC">
        <value caption="clk_lcd/8" name="8" value="0x00"/>
        <value caption="clk_lcd/16" name="16" value="0x01"/>
      </value-group>
      <value-group caption="Type of Digit" name="LCD_TDG">
        <value caption="7-segment with 3 COMs" name="7S_3C" value="0x00"/>
        <value caption="7-segment with 4 COMs" name="7S_4C" value="0x01"/>
        <value caption="14-segment with 4 COMs" name="14S_4C" value="0x02"/>
        <value caption="16-segment with 3 COMs" name="16S_3C" value="0x03"/>
      </value-group>
      <interrupt-group name="LCD">
        <interrupt index="0" name="INT" caption="LCD Interrupt"/>
      </interrupt-group>
    </module>
    <module name="FUSE" id="I6570" version="XMEGAAU" caption="Fuses and Lockbits">
      <register-group caption="Fuses" name="NVM_FUSES" size="6">
        <register caption="JTAG User ID" name="FUSEBYTE0" offset="0x00" size="1">
          <bitfield caption="JTAG User ID" mask="0xFF" name="JTAGUSERID"/>
        </register>
        <register caption="Watchdog Configuration" name="FUSEBYTE1" offset="0x01" size="1">
          <bitfield caption="Watchdog Window Timeout Period" mask="0xF0" name="WDWP" values="WD"/>
          <bitfield caption="Watchdog Timeout Period" mask="0x0F" name="WDP" values="WDP"/>
        </register>
        <register caption="Reset Configuration" name="FUSEBYTE2" offset="0x02" size="1">
          <bitfield caption="Boot Loader Section Reset Vector" mask="0x40" name="BOOTRST" values="BOOTRST"/>
          <bitfield caption="Timer Oscillator pin location" mask="0x20" name="TOSCSEL" values="TOSCSEL"/>
          <bitfield caption="BOD Operation in Power-Down Mode" mask="0x03" name="BODPD" values="BOD"/>
        </register>
        <register caption="Start-up Configuration" name="FUSEBYTE4" offset="0x04" size="1">
          <bitfield caption="External Reset Disable" mask="0x10" name="RSTDISBL"/>
          <bitfield caption="Start-up Time" mask="0x0C" name="SUT" values="SUT"/>
          <bitfield caption="Watchdog Timer Lock" mask="0x02" name="WDLOCK"/>
          <bitfield caption="JTAG Interface Enable" mask="0x01" name="JTAGEN"/>
        </register>
        <register caption="EESAVE and BOD Level" name="FUSEBYTE5" offset="0x05" size="1">
          <bitfield caption="BOD Operation in Active Mode" mask="0x30" name="BODACT" values="BODACT"/>
          <bitfield caption="Preserve EEPROM Through Chip Erase" mask="0x08" name="EESAVE"/>
          <bitfield caption="Brownout Detection Voltage Level" mask="0x07" name="BODLVL" values="BODLVL"/>
        </register>
      </register-group>
      <value-group caption="Boot Loader Section Reset Vector" name="BOOTRST">
        <value caption="Boot Loader Reset" name="BOOTLDR" value="0x00"/>
        <value caption="Application Reset" name="APPLICATION" value="0x01"/>
      </value-group>
      <value-group caption="Timer Oscillator pin location" name="TOSCSEL">
        <value caption="TOSC1 / TOSC2 on separate pins" name="ALTERNATE" value="0x00"/>
        <value caption="TOSC1 / TOSC2 shared with XTAL1 / XTAL2" name="XTAL" value="0x01"/>
      </value-group>
      <value-group caption="BOD operation" name="BOD">
        <value caption="BOD enabled in sampled mode" name="SAMPLED" value="0x01"/>
        <value caption="BOD enabled continuously" name="CONTINUOUS" value="0x02"/>
        <value caption="BOD Disabled" name="DISABLED" value="0x03"/>
      </value-group>
      <value-group caption="BOD operation" name="BODACT">
        <value caption="BOD enabled in sampled mode" name="SAMPLED" value="0x01"/>
        <value caption="BOD enabled continuously" name="CONTINUOUS" value="0x02"/>
        <value caption="BOD Disabled" name="DISABLED" value="0x03"/>
      </value-group>
      <value-group caption="Watchdog (Window) Timeout Period" name="WD">
        <value caption="8 cycles (8ms @ 3.3V)" name="8CLK" value="0x00"/>
        <value caption="16 cycles (16ms @ 3.3V)" name="16CLK" value="0x01"/>
        <value caption="32 cycles (32ms @ 3.3V)" name="32CLK" value="0x02"/>
        <value caption="64 cycles (64ms @ 3.3V)" name="64CLK" value="0x03"/>
        <value caption="128 cycles (0.125s @ 3.3V)" name="128CLK" value="0x04"/>
        <value caption="256 cycles (0.25s @ 3.3V)" name="256CLK" value="0x05"/>
        <value caption="512 cycles (0.5s @ 3.3V)" name="512CLK" value="0x06"/>
        <value caption="1K cycles (1s @ 3.3V)" name="1KCLK" value="0x07"/>
        <value caption="2K cycles (2s @ 3.3V)" name="2KCLK" value="0x08"/>
        <value caption="4K cycles (4s @ 3.3V)" name="4KCLK" value="0x09"/>
        <value caption="8K cycles (8s @ 3.3V)" name="8KCLK" value="0x0A"/>
      </value-group>
      <value-group caption="Watchdog (Window) Timeout Period" name="WDP">
        <value caption="8 cycles (8ms @ 3.3V)" name="8CLK" value="0x00"/>
        <value caption="16 cycles (16ms @ 3.3V)" name="16CLK" value="0x01"/>
        <value caption="32 cycles (32ms @ 3.3V)" name="32CLK" value="0x02"/>
        <value caption="64 cycles (64ms @ 3.3V)" name="64CLK" value="0x03"/>
        <value caption="128 cycles (0.125s @ 3.3V)" name="128CLK" value="0x04"/>
        <value caption="256 cycles (0.25s @ 3.3V)" name="256CLK" value="0x05"/>
        <value caption="512 cycles (0.5s @ 3.3V)" name="512CLK" value="0x06"/>
        <value caption="1K cycles (1s @ 3.3V)" name="1KCLK" value="0x07"/>
        <value caption="2K cycles (2s @ 3.3V)" name="2KCLK" value="0x08"/>
        <value caption="4K cycles (4s @ 3.3V)" name="4KCLK" value="0x09"/>
        <value caption="8K cycles (8s @ 3.3V)" name="8KCLK" value="0x0A"/>
      </value-group>
      <value-group caption="Start-up Time" name="SUT">
        <value caption="0 ms" name="0MS" value="0x03"/>
        <value caption="4 ms" name="4MS" value="0x01"/>
        <value caption="64 ms" name="64MS" value="0x00"/>
      </value-group>
